[
    "Yo mama so ugly even Hello Kitty said good bye.",
    "Yo mama so skinny when she swallowed a meatball everyone thought she was pregnant again.",
    "Yo mama so ugly when she looks in the mirror her reflection ducks.",
    "Yo mama so stupid she tried to put her M&Ms in alphabetical order.",
    "Yo mama so stupid she went to the dentist to get a blue tooth.",
    "Yo mama so stupid she got locked in a mattress store and slept on the floor.", 
    "Yo mama so stupid she failed a survey.",
    "Yo mama so stupid she got fired from a blow job.",
    "Yo mama so stupid she thinks Taco Bell is a Mexican phone company. ",
    "Yo mama so stupid she tried to climb Mountain Dew.",
    "Yo mama so stupid she went to the YMCA thinking it's Macy's.",
    "Yo mama is so stupid, she won't play Candy Crush cause she has diabetes.",
    "Yo mama so old the back of her head looks like a raisin. ",
    "Yo mama so old her social security number is 1. ",
    "Yo mama so old when she was a child rainbows were still in black and white. ",
    "Yo mama so old when she was in school there was no history class. ",
    "Yo mama so old she has a picture of Moses in her yearbook.",
    "Yo mama so old she was a crossing guard when Moses parted the red sea. ",
    "Yo mama so old she was a waitress at the Last Supper.",
    "Yo mama so old she has an autographed bible. ",
    "Yo mama so old she knew Mr. Clean when he had an afro.",
    "Yo mama so old she knew Gandalf before he had a beard.",
    "Yo mama so fat she wears a sock on each toe. ",
    "Yo mama so fat her belly button got an echo. ",
    "Yo mama so fat you have to roll over twice to get off her. ",
    "Yo mama so fat when she takes a bath there's no room left for any water in the tub. ",
    "Yo mama so fat when I pictured her in my head I almost broke my neck. ",
    "Yo mama so fat her blood type is Nutella.",
    "Yo mama so fat she gave Dracula high cholesterol.",
    "Yo mama so fat her ass has its own zip code.",
    "Yo mama so fat she uses bacon as breath mints.",
    "Yo mama so fat she uses Google Earth to take a selfie.",
    "Yo mama so skinny she hula hoops with a cheerio.",
    "Yo mama so skinny she can grate cheese on her ribs. ",
    "Yo mama so skinny her nipples touch. ",
    "Yo mama is so skinny she can dodge raindrops. ",
    "Yo mama's so skinny when her pimp slapped her he got a paper cut. ",
    "Yo mama so skinny she uses Chapstick for deodorant.",
    "Yo mama so skinny she uses a tea bag as her pillow. ",
    "Yo mama so skinny she uses a Band-Aid as a maxi-pad.",
    "Yo mama so skinny when she swallowed a meatball everyone thought she was pregnant again.",
    "Yo mama so skinny if she had a yeast infection she'd be a Quarter Pounder with cheese.",
    "Yo mama so poor she went to McDonald's and put a milkshake on layaway.",
    "Yo mama so poor she has the ducks throw bread at her.",
    "Yo mama so fat she uses Google Earth to take a selfie.",
    "Yo mama so skinny she hula hoops with a cheerio.",
    "Yo mama so hairy people think she's an Ewok.",
    "Yo mama so poor when I saw her kicking a can down the street, I asked her what she was doing, she said \"Moving.\" ",
    "Yo mama's so fat, when she fell I didn't laugh, but the sidewalk cracked up.",
    "Yo mama's so fat, when she skips a meal, the stock market drops.",
    "Yo mama's so fat, it took me two buses and a train to get to her good side.",
    "Yo mama's so fat, when she goes camping, the bears hide their food.",
    "Yo mama's so fat, if she buys a fur coat, a whole species will become extinct.",
    "Yo mama's so fat, she stepped on a scale and it said: \"To be continued\"",
    "Yo mama's so fat, I swerved to miss her in my car and ran out of gas.",
    "Yo mama's so fat, when she wears high heels, she strikes oil.",
    "Yo mama's so fat, she was overthrown by a small militia group, and now she's known as the Republic of Yo Mama.",
    "Yo mama's so fat, when she sits around the house, she SITS AROUND the house.",
    "Yo mama's so fat, her car has stretch marks.",
    "Yo mama's so fat, she can't even jump to a conclusion.",
    "Yo mama's so fat, her blood type is Ragu.",
    "Yo mama's so fat, if she was a Star Wars character, her name would be Admiral Snackbar.",
    "Yo mama's so fat, she brought a spoon to the Super Bowl.",
    "Yo mama's so stupid, she stared at a cup of orange juice for 12 hours because it said \"concentrate.\"",
    "Yo mama's so stupid when they said it was chilly outside, she grabbed a bowl.",
    "Yo mama's so stupid, she put lipstick on her forehead to make up her mind.",
    "Yo mama's so stupid, when they said, \"Order in the court,\" she asked for fries and a shake.",
    "Yo mama's so stupid, she thought a quarterback was a refund.",
    "Yo mama's so stupid, she thought a quarterback was a refund.",
    "Yo mama's so stupid, she got hit by a parked car.",
    "Yo mama's so stupid, when I told her that she lost her mind, she went looking for it",
    "Yo mama's so stupid when thieves broke into her house and stole the TV, she chased after them shouting \"Wait, you forgot the remote!\" ",
    "Yo mama's so stupid, she went to the dentist to get a Bluetooth.",
    "Yo mama's so stupid, she took a ruler to bed to see how long she slept.",
    "Yo mama's so stupid, she got locked in the grocery store and starved to death.",
    "Yo mama's so stupid, when I said, \"Drinks on the house,\" she got a ladder.",
    "Yo mama's so stupid, it takes her two hours to watch 60 Minutes.",
    "Yo mama's so stupid, she put airbags on her computer in case it crashed.",
    "Yo mama's so ugly, she threw a boomerang and it refused to come back.",
    "Yo mama's so old, her social security number is one.",
    "Yo mama's so ugly, she made a blind kid cry.",
    "Yo mama's so ugly, her portraits hang themselves.",
    "Yo mama's so old, she walked out of a museum and the alarm went off.",
    "Yo mama's teeth are so yellow when she smiles at traffic, it slows down.",
    "Yo mama's armpits are so hairy, it looks like she's got Buckwheat in a headlock.",
    "Yo mama's so ugly, when she was little, she had to trick-or-treat by phone.",
    "Yo mama's so ugly, her birth certificate is an apology letter.",
    "Yo mama's so ugly, she looked out the window and was arrested for mooning.",
    "Yo mama's so poor, the ducks throw bread at her.",
    "Yo mama's so poor, she chases the garbage truck with a grocery list.",
    "Yo mama's cooking so nasty, she flys got together and fixed the hole in the window screen.",
    "Yo mama's so depressing, blues singers come to visit her when they've got writer's block.",
    "Yo mama's so short, you can see her feet on her driver's license.",
    "Yo mama's so poor, she can't even afford to pay attention.",
    "Yo mama so big, her belt size is \"equator.\" ",
    "Yo mama's so classless, she's a Marxist utopia.",
    "Yo mama so short, she went to see Santa and he told her to get back to work.",
    "Yo mama so scary, the government moved Halloween to her birthday.",
    "Yo mama's so nasty, they used to call them jumpolines 'til yo mama bounced on one.",
    "Yo mama's teeth so yellow, I can't believe it's not butter.",
    "Yo mama's so poor, Nigerian princes wire her money.",
    "Yo mama so dumb, she went to the eye doctor to get an iPhone.",
    "Yo mama's so lazy, she stuck her nose out the window and let the wind blow it.",
]